#include <stdio.h>

int i, j;

int main() {
    printf("\nВ языке С результатом операции 'остаток'\n");
    printf("является значение выражения: a - a / b * a\n");
    printf("Например, остаток от деления 19 на 5 равен %d\n", 19 % 5); // == 4
    printf("Это равно значению выражения 19 - 19 / 5 * 5: %d\n", 19 - 19 / 5 * 5);
    printf("Данная формула работает и в случае отрицательных операндов:\n");
    printf("%d\n", -19 % 5 == -19 - -19 / 5 * 5); // == -4
    printf("%d\n", 19 % -5 == 19 - 19 / -5 * -5); // == 4
    printf("%d\n", -19 % -5 == -19 - -19 / -5 * -5); // == -4
    printf("Дополнительная проверка для чисел от -100 до 100: \n");
    for (i = 100; i >= -100; i--)
        for (j = 100; j >= -100; j--)
            if (j != 0 && i % j != i - (i / j) * j) {
                printf("error, i = %d, j = ", i);
                printf("%d, остаток = ", j);
                printf("%d, вместо ", i % j);
                printf("%d\n\n", i - (i / j) * j);
            }
    printf("Если ничего не напечаталось, значит формула скорее всего верна.\n");
    // (a / b) - частное, округленное в сторону нуля
}
