%{
#include <stdio.h>

int yylex(void);
void yyerror(char *);
%}
%%
S: A{printf("Ответ: %d\n", $1);}
A: A '+' M{$$ = $1 + $3;}
 | A '-' M{$$ = $1 - $3;}
 | M{$$ = $1;}
 | {$$ = 0;}
M: C '*' C { $$ = $1 * $3;}
 | C '/' C { if ($3 == 0) yyerror("Ошибка - деление на 0!"); else $$ = $1 / $3;}
 | C{$$ = $1;}
C: C N{$$ = 10 * $1 + $2;}
 | N{$$ = $1;}
 | '(' A ')'{$$ = $2;}
N: '0'{$$ = 0;}
  |'1'{$$ = 1;}
  |'2'{$$ = 2;}
  |'3'{$$ = 3;}
  |'4'{$$ = 4;}
  |'5'{$$ = 5;}
  |'6'{$$ = 6;}
  |'7'{$$ = 7;}
  |'8'{$$ = 8;}
  |'9'{$$ = 9;}
%%
int main(){
    printf("Введите арифметические выражение, \nсостоящее из чисел, скобок и операций +, -, *, /: ");
    yyparse();
}

int yylex(){
    int c;
    c = getchar ();
    if (c == '\n')
	return 0;
    yylval = c;
    return c;
}

void yyerror(char *s) {
    printf("Ошибка: %s\n", s);
}